# Import libraries

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

# Import the dataset

In [8]:
dataset = pd.read_csv('Position_Salaries.csv')
dataset.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

# Creating another dataset to analyse

In [12]:
d2 = pd.DataFrame()
d2['Level'], d2['Salary'] = dataset['Level'], dataset['Salary']
d2.head()

   Level  Salary
0      1   45000
1      2   50000
2      3   60000
3      4   80000
4      5  110000